<a href="https://colab.research.google.com/github/NicoPatalagua/Pandas/blob/master/PandasExercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas Exercises**
## *Patalagua Suárez Nicolás*
### Universidad Sergio Arboleda

### ***What is Pandas?***

In Computing and Data Science, pandas is a software library written as an extension to NumPy for data manipulation and analysis for the Python programming language. In particular, it offers data structures and operations for number tables and time series. It is free software distributed under the BSD version three clauses license.

 https://pandas.pydata.org/

### ***What is Numpy?***

NumPy is a Python extension, which adds more support for vectors and matrices, constituting a library of high-level mathematical functions to operate with those vectors or matrices. NumPy's ancestor Numeric was originally created by Jim Hugunin with some contributions from other developers. In 2005 Travis Oliphant created NumPy incorporating Numarray features into NumPy with some modifications.


 https://numpy.org/

### ***Repository***
This work was done taking into account the repository https://github.com/guipsamora/pandas_exercises, developed by Guilherme Samora, who is a Senior Product Manager at the Global Savings Group in Munich - Germany.

## ***Getting and knowing***

### ***Chiotle***

Dataset and materials: https://github.com/justmarkham

**Step 1.** *Import the necessary libraries*

In [0]:
#Import the pandas library and assign it to the variable pd
import pandas as pd
#Import the numpy library and assign it to the variable np
import numpy as np

**Step 2.** *Import the dataset from this address.*

In [0]:
#Assign the dataset variable the path of the repository where the file to be used is
dataset = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'

**Step 3.** *Assign it to a variable called chipo.*

In [0]:
#Create the variable chipo
chipo = pd.read_csv(dataset, sep = '\t')

**Step 4.** *See the first 10 entries.*

In [6]:
#With head we show a specific amount of data
chipo.head(10)

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98
5         3  ...     $10.98
6         3  ...      $1.69
7         4  ...     $11.75
8         4  ...      $9.25
9         5  ...      $9.25

[10 rows x 5 columns]

**Step 5.** *What is the number of observations in the dataset?*

In [8]:
#With shape with a 0 we can show the number of rows in the file
chipo.shape[0]

4622

**Step 6.** *What is the number of columns in the dataset?*

In [9]:
#With shape with a 1 we can show the number of columns in the file
chipo.shape[1]

5

**Step 7.** *Print the name of all the columns.*

In [11]:
#If we add columns to the variable that reads the file, it prints the name of the columns
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

**Step 8.** *How is the dataset indexed?*

In [13]:
#The index method returns the number of indexes of the variable
chipo.index

RangeIndex(start=0, stop=4622, step=1)

**Step 9.** *Which was the most-ordered item?*

In [14]:
#Group by items with groupby,Sum the grouped data with the previous method 
#and Order the values ​​by quantity
ObjItem= chipo.groupby('item_name').sum().sort_values(['quantity'], ascending=False)
#Print the Item most-ordered
ObjItem.iloc[0,0:0]

Series([], Name: Chicken Bowl, dtype: int64)

**Step 10.** *For the most-ordered item, how many items were ordered?*

In [15]:
#Print Quantity of ordered items
ObjItem.iloc[0,1]

761

**Step 11.** *What was the most ordered item in the choice_description column?*

In [0]:
#Group by items with groupby,Sum the grouped data with the previous method 
#and Order the values ​​by quantity
ObjItem= chipo.groupby('choice_description').sum().sort_values(['quantity'], ascending=False)
#Print the Item most-ordered
ObjItem.iloc[0,0:1]

order_id    123455
Name: [Diet Coke], dtype: int64

**Step 12.** *How many items were orderd in total?*

In [0]:
#Count the quantity of items ordered with the quantity column
chipo.quantity.sum()

4972

**Step 13.** *Turn the item price into a float.*

> **a.** *Check the item price type.*

In [0]:
#with the dtype method we return the data type of the selected column
chipo.item_price.dtype

dtype('O')



> **b.** *Create a lambda function and change the type of item price.*

In [0]:
#Assign the column itemprice to chipo and later we apply the lambda function
chipo.item_price=chipo.item_price.apply(lambda x: float(x[1:-1]))


>**c.** *Check the item price type.*

In [0]:
#recheck data type
chipo.item_price.dtype

dtype('float64')

**Step 14.** *How much was the revenue for the period in the dataset?*

In [0]:
#We multiply the quantity by the price and add the result
(chipo['quantity']*chipo['item_price']).sum()

39237.02

**Step 15.** *How many orders were made in the period?*

In [0]:
#Count the number of order data with valuecounts
#With count return the length that corresponds to the number of orders
chipo.order_id.value_counts().count()

1834

**Step 16.** *What is the average revenue amount per order?*

In [0]:
#With the group method ordered by order_id, 
#Add the data and get the average (Specify revenue)
chipo.groupby('order_id').sum().mean()['revenue']

21.394231188658654

**Step 17.** *How many different items are sold?*

In [0]:
#Count the number of different items 
#Count the number of items obtained
chipo.item_name.value_counts().count()

50

### ***Occupation***

Dataset and materials: https://github.com/justmarkham

**Step 1.** *Import the necessary libraries.*

In [0]:
#Import the pandas library and assign it to the variable pd
import pandas as pd
#Import the numpy library and assign it to the variable np
import numpy as np

**Step 2.** *Import the dataset from this address.*

In [0]:
#Assign the dataset variable the path of the repository where the file to be used is
dataset = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

**Step 3.** *Assign it to a variable called users and use the 'user_id' as index.*

In [0]:
#Create the variable users and use user_id as index
users = pd.read_csv(dataset, sep='|', index_col='user_id')

**Step 4.** *See the first 25 entries.*

In [22]:
#With head we show a specific amount of data
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

**Step 5.** *See the last 10 entries.*

In [23]:
#The head method returns the header, however tail returns the data at the end of a file.
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

**Step 6.** *What is the number of observations in the dataset?*

In [24]:
#With shape with a 0 we can show the number of rows in the file
users.shape[0]

943

**Step 7.** *What is the number of columns in the dataset?*

In [25]:
#With shape with a 1 we can show the number of columns in the file
users.shape[1]

4

**Step 8.** *Print the name of all the columns.*

In [26]:
#If we add columns to the variable that reads the file, it prints the name of the columns
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

**Step 9.** *How is the dataset indexed?*

In [28]:
#The index method returns the indexing of the dataset
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

**Step 10.** *What is the data type of each column?*

In [29]:
#with the dtype method we return the data type of the selected column
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

**Step 11.** *Print only the occupation column.*

In [31]:
#the required column can be called as a method to return it
users.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

**Step 12.** *How many different occupations are in this dataset?*

In [33]:
#Adding the count of the differences between data to the previous query achieves what is required in this
users.occupation.value_counts().count()

21

**Step 13.** *What is the most frequent occupation?*

In [36]:
#Show the header of the previous command
users.occupation.value_counts().head()

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

**Step 14.** *Summarize the DataFrame.*

In [37]:
#With the describe method, this information is obtained
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

**Step 15.** *Summarize all the columns.*

In [39]:
#If everything is defined for the previous query, send the detail of everything
users.describe(include = "all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

**Step 16.** *Summarize only the occupation column.*

In [41]:
#Only the describe method is called
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

**Step 17.** *What is the mean age of users?*

In [45]:
#With the age method and the average method applied to the list of users
users.age.mean()

34.05196182396607

In [46]:
#And it is rounded
round(users.age.mean())

34

**Step 18.** *What is the age with least occurrence?*

In [51]:
#It is counted by age repetitions and the queue is returned from the list
users.age.value_counts().tail()

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64

### ***World Food Facts***


**Step 1.** *Go to https://www.kaggle.com/openfoodfacts/world-food-facts/data*

In [0]:
#Import the pandas library and assign it to the variable pd
import pandas as pd
#Import the numpy library and assign it to the variable np
import numpy as np

**Step 2.** *Download the dataset to your computer and unzip it.*

In [0]:
dataset='en.openfoodfacts.org.products.tsv'

**Step 3.** *Use the tsv file and assign it to a dataframe called food.*

In [58]:
#Create the variable food
food = pd.read_csv(dataset, sep='\t')

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (19,20,24,25,26,28,37,38,39,48) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

**Step 4.** *See the first 5 entries.*

In [60]:
#With head we show a specific amount of data
food.head(5)

    code  ... water-hardness_100g
0   3087  ...                 NaN
1   4530  ...                 NaN
2   4559  ...                 NaN
3  16087  ...                 NaN
4  16094  ...                 NaN

[5 rows x 163 columns]

**Step 5.** *What is the number of observations in the dataset?*

In [69]:
#With shape we can show the number of rows in the file
food.shape

(53805, 163)

**Step 6.** *What is the number of columns in the dataset?*

In [70]:
#With shape with a 0 we can show the number of rows in the file
food.shape[1]

163

**Step 7.** *Print the name of all the columns.*

In [72]:
#If we add columns to the variable that reads the file, it prints the name of the columns
food.columns

Index(['code', 'url', 'creator', 'created_t', 'created_datetime',
       'last_modified_t', 'last_modified_datetime', 'product_name',
       'generic_name', 'quantity',
       ...
       'fruits-vegetables-nuts_100g', 'fruits-vegetables-nuts-estimate_100g',
       'collagen-meat-protein-ratio_100g', 'cocoa_100g', 'chlorophyl_100g',
       'carbon-footprint_100g', 'nutrition-score-fr_100g',
       'nutrition-score-uk_100g', 'glycemic-index_100g',
       'water-hardness_100g'],
      dtype='object', length=163)

**Step 8.** *What is the name of 105th column?*

In [73]:
#The first column begins its count at 0 therefore 104 is required
food.columns[104]

'-glucose_100g'


**Step 9.** *What is the type of the observations of the 105th column?*

In [74]:
#the previous query is called from the dtypes method of the food variable
food.dtypes[food.columns[104]]

dtype('float64')

**Step 10.** *How is the dataset indexed?*

In [75]:
#The index method returns the number of indexes of the variable
food.index

RangeIndex(start=0, stop=53805, step=1)

**Step 11.** *What is the product name of the 19th observation?*

In [76]:
#It's called the observation column and the corresponding row
food.values[18][7]

'Lotus Organic Brown Jasmine Rice'

## ***Filtering and Sorting Data***

### **Euro 12**

**Step 1.** Import the necessary libraries

In [0]:
#Import the pandas library and assign it to the variable pd
import pandas as pd
#Import the numpy library and assign it to the variable np
import numpy as np

**Step 2.** Import the dataset from this address.

In [0]:
#Assign the dataset variable the path of the repository where the file to be used is
dataset = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/02_Filtering_%26_Sorting/Euro12/Euro_2012_stats_TEAM.csv'

**Step 3.** Assign it to a variable called euro12.

In [0]:
#Create the variable euro12
euro12 = pd.read_csv(dataset, sep=',')

**Step 4.** Select only the Goal column.

In [104]:
#the required column can be called as a method to return it
euro12.Goals

0      4
1      4
2      4
3      5
4      3
5     10
6      5
7      6
8      2
9      2
10     6
11     1
12     5
13    12
14     5
15     2
Name: Goals, dtype: int64

**Step 5.** How many team participated in the Euro2012?

In [105]:
#With shape with a 0 we can show the number of teams in the file
euro12.shape[0]

16

**Step 6.** What is the number of columns in the dataset?

In [106]:
#With shape with a 1 we can show the number of columns in the file
euro12.shape[1]

35

**Step 7.** View only the columns Team, Yellow Cards and Red Cards and assign them to a dataframe called discipline

In [108]:
#For this, the columns to be called within the square brackets are specified.
euro12[['Team', 'Yellow Cards', 'Red Cards']]

                   Team  Yellow Cards  Red Cards
0               Croatia             9          0
1        Czech Republic             7          0
2               Denmark             4          0
3               England             5          0
4                France             6          0
5               Germany             4          0
6                Greece             9          1
7                 Italy            16          0
8           Netherlands             5          0
9                Poland             7          1
10             Portugal            12          0
11  Republic of Ireland             6          1
12               Russia             6          0
13                Spain            11          0
14               Sweden             7          0
15              Ukraine             5          0

**Step 8.** Sort the teams by Red Cards, then to Yellow Cards

In [110]:
#For this, the ordering method is added to the previous query so it is searched
euro12[['Team', 'Yellow Cards', 'Red Cards']].sort_values(['Red Cards', 'Yellow Cards'], ascending = False)

                   Team  Yellow Cards  Red Cards
6                Greece             9          1
9                Poland             7          1
11  Republic of Ireland             6          1
7                 Italy            16          0
10             Portugal            12          0
13                Spain            11          0
0               Croatia             9          0
1        Czech Republic             7          0
14               Sweden             7          0
4                France             6          0
12               Russia             6          0
3               England             5          0
8           Netherlands             5          0
15              Ukraine             5          0
2               Denmark             4          0
5               Germany             4          0

**Step 9.** Calculate the mean Yellow Cards given per Team

In [113]:
#The average method applied to the list of euro12
euro12['Yellow Cards'].mean()

7.4375

In [114]:
#And it is rounded
round(euro12['Yellow Cards'].mean())

7

**Step 10.** Filter teams that scored more than 6 goals

In [117]:
#for this, within the euro variable, the logical operation must be performed
euro12[euro12.Goals > 6]

       Team  Goals  Shots on target  ...  Subs on Subs off Players Used
5   Germany     10               32  ...       15       15           17
13    Spain     12               42  ...       17       17           18

[2 rows x 35 columns]

**Step 11.** Select the teams that start with G

In [120]:
#for this within the variable euro12, we look for the equipment
#that in the search for a G at the beginning returns true
euro12[euro12.Team.str.startswith('G')]

      Team  Goals  Shots on target  ...  Subs on Subs off Players Used
5  Germany     10               32  ...       15       15           17
6   Greece      5                8  ...       12       12           20

[2 rows x 35 columns]

**Step 12.** Select the first 7 columns

In [131]:
#With iloc choose the first row and the columns from 0 to 7
euro12.iloc[0, 0:7]

Team                          Croatia
Goals                               4
Shots on target                    13
Shots off target                   12
Shooting Accuracy               51.9%
% Goals-to-shots                16.0%
Total shots (inc. Blocked)         32
Name: 0, dtype: object

**Step 13.** Select all columns except the last 3.

In [140]:
#With iloc choose the columns -6 to -3 columns
euro12.iloc[0 ,-6:-3]

Offsides        2
Yellow Cards    9
Red Cards       0
Name: 0, dtype: object

**Step 14.** Present only the Shooting Accuracy from England, Italy and Russia

In [146]:
# With loc and the queary
euro12.loc[euro12.Team.isin(['England', 'Italy', 'Russia']), ['Team','Shooting Accuracy']]

       Team Shooting Accuracy
3   England             50.0%
7     Italy             43.0%
12   Russia             22.5%

### **Fictional Army**

**Step 1.** Import the necessary libraries

In [0]:
#Import the pandas library and assign it to the variable pd
import pandas as pd
#Import the numpy library and assign it to the variable np
import numpy as np

**Step 2.** This is the data given as a dictionary

In [0]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}

**Step 3.** Create a dataframe and assign it to a variable called army.

In [0]:
#Create the variable army
army = pd.DataFrame(data=raw_data)


**Step 4.** Set the 'origin' colum as the index of the dataframe

In [0]:
#Replace with inplace
army.set_index('origin', inplace=True)

In [183]:
#print army to verify
army.iloc[:,0:0]

Empty DataFrame
Columns: []
Index: [Arizona, California, Texas, Florida, Maine, Iowa, Alaska, Washington, Oregon, Wyoming, Louisana, Georgia]

**Step 5.** Print only the column veterans

In [184]:
#call the veterans column as if it were a method
army.veterans

origin
Arizona         1
California      5
Texas          62
Florida        26
Maine          73
Iowa           37
Alaska        949
Washington     48
Oregon         48
Wyoming       435
Louisana       63
Georgia       345
Name: veterans, dtype: int64

**Step 6.** Print the columns 'veterans' and 'deaths'

In [185]:
#Return the veterans and the dead
army[["veterans", "deaths"]]

            veterans  deaths
origin
Arizona            1     523
California         5      52
Texas             62      25
Florida           26     616
Maine             73      43
Iowa              37     234
Alaska           949     523
Washington        48      62
Oregon            48      62
Wyoming          435      73
Louisana          63      37
Georgia          345      35

**Step 7.** Print the name of all the columns.

In [186]:
#If we add columns to the variable that reads the file,
#it prints the name of the columns
army.columns

Index(['regiment', 'company', 'deaths', 'battles', 'size', 'veterans',
       'readiness', 'armored', 'deserters'],
      dtype='object')

**Step 8.** Select the 'deaths', 'size' and 'deserters' columns from Maine and Alaska

In [187]:
#With the loc method make the query
army.loc[["Maine", "Alaska"], ["deaths", "size", "deserters"]]

        deaths  size  deserters
origin
Maine       43  1592          3
Alaska     523   987         24

**Step 9.** Select the rows 3 to 7 and the columns 3 to 6

In [189]:
#Wich iloc choose the columns
army.iloc[2:7, 2:6]

         deaths  battles  size  veterans
origin
Texas        25        2  1099        62
Florida     616        2  1400        26
Maine        43        4  1592        73
Iowa        234        7  1006        37
Alaska      523        8   987       949

**Step 10.** Select every row after the fourth row and all columns

In [190]:
#Wich iloc choose the columns and rows
army.iloc[4:, :]

            regiment company  deaths  ...  readiness  armored  deserters
origin                                ...
Maine       Dragoons     1st      43  ...          2        0          3
Iowa        Dragoons     1st     234  ...          1        1          4
Alaska      Dragoons     2nd     523  ...          2        0         24
Washington  Dragoons     2nd      62  ...          3        1         31
Oregon        Scouts     1st      62  ...          2        0          2
Wyoming       Scouts     1st      73  ...          1        0          3
Louisana      Scouts     2nd      37  ...          2        1          2
Georgia       Scouts     2nd      35  ...          3        1          3

[8 rows x 9 columns]

**Step 11.** Select every row up to the 4th row and all columns

In [191]:
#Wich iloc choose the columns and rows
army.iloc[:4, :]

              regiment company  deaths  ...  readiness  armored  deserters
origin                                  ...
Arizona     Nighthawks     1st     523  ...          1        1          4
California  Nighthawks     1st      52  ...          2        0         24
Texas       Nighthawks     2nd      25  ...          3        1         31
Florida     Nighthawks     2nd     616  ...          3        1          2

[4 rows x 9 columns]

**Step 12.** Select the 3rd column up to the 7th column

In [192]:
#Wich iloc choose the columns and rows
army.iloc[:,2:7]

            deaths  battles  size  veterans  readiness
origin
Arizona        523        5  1045         1          1
California      52       42   957         5          2
Texas           25        2  1099        62          3
Florida        616        2  1400        26          3
Maine           43        4  1592        73          2
Iowa           234        7  1006        37          1
Alaska         523        8   987       949          2
Washington      62        3   849        48          3
Oregon          62        4   973        48          2
Wyoming         73        7  1005       435          1
Louisana        37        8  1099        63          2
Georgia         35        9  1523       345          3

**Step 13.** Select rows where df.deaths is greater than 50

In [201]:
#In the army variable we perform the logical operation
army[army["deaths"] > 50].iloc[:,2:3]

            deaths
origin
Arizona        523
California      52
Florida        616
Iowa           234
Alaska         523
Washington      62
Oregon          62
Wyoming         73

**Step 14.** Select rows where df.deaths is greater than 500 or less than 50

In [205]:
#In the army variable we perform the logical operation
army[(army["deaths"] > 500) | (army["deaths"] < 50)].iloc[:,2:3]

          deaths
origin
Arizona      523
Texas         25
Florida      616
Maine         43
Alaska       523
Louisana      37
Georgia       35

**Step 15.** Select all the regiments not named "Dragoons"

In [208]:
#In the army variable we perform the logical operation
army[army["regiment"] != "Dragoons"].iloc[:,0]

origin
Arizona       Nighthawks
California    Nighthawks
Texas         Nighthawks
Florida       Nighthawks
Oregon            Scouts
Wyoming           Scouts
Louisana          Scouts
Georgia           Scouts
Name: regiment, dtype: object

**Step 16.** Select the rows called Texas and Arizona

In [212]:
#In the army variable we perform the logical operation and use loc
army.loc[["Texas", "Arizona"]].iloc[:,0]

origin
Texas      Nighthawks
Arizona    Nighthawks
Name: regiment, dtype: object

**Step 17.** Select the third cell in the row named Arizona

In [213]:
#In the army variable we perform the logical operation and use loc and iloc
army.loc[["Arizona"]].iloc[:, 2]

origin
Arizona    523
Name: deaths, dtype: int64

**Step 18.** Select the third cell down in the column named deaths

In [214]:
#In the army variable we perform search and use loc and iloc
army.loc[:, ["deaths"]].iloc[2]

deaths    25
Name: Texas, dtype: int64